pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR32DU20def.inc
; PORT_PIN2CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN3CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN4CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN5CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN6CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_PIN7CTRL masks
; Masks for PORT_ISC already defined
; Masks for PORT_PULLUPEN already defined
; Masks for PORT_INLVL already defined
; Masks for PORT_INVEN already defined

; PORT_EVGENCTRLA masks
.equ PORT_EVGEN0SEL_gm = 0x07            ; Event Generator 0 Select group mask
.equ PORT_EVGEN0SEL_gp = 0               ; Event Generator 0 Select group position
.equ PORT_EVGEN0SEL_0_bm = (1<<0)        ; Event Generator 0 Select bit 0 mask
.equ PORT_EVGEN0SEL_0_bp = 0             ; Event Generator 0 Select bit 0 position
.equ PORT_EVGEN0SEL_1_bm = (1<<1)        ; Event Generator 0 Select bit 1 mask
.equ PORT_EVGEN0SEL_1_bp = 1             ; Event Generator 0 Select bit 1 position
.equ PORT_EVGEN0SEL_2_bm = (1<<2)        ; Event Generator 0 Select bit 2 mask
.equ PORT_EVGEN0SEL_2_bp = 2             ; Event Generator 0 Select bit 2 position
.equ PORT_EVGEN1SEL_gm = 0x70            ; Event Generator 1 Select group mask
.equ PORT_EVGEN1SEL_gp = 4               ; Event Generator 1 Select group position
.equ PORT_EVGEN1SEL_0_bm = (1<<4)        ; Event Generator 1 Select bit 0 mask
.equ PORT_EVGEN1SEL_0_bp = 4             ; Event Generator 1 Select bit 0 position
.equ PORT_EVGEN1SEL_1_bm = (1<<5)        ; Event Generator 1 Select bit 1 mask
.equ PORT_EVGEN1SEL_1_bp = 5             ; Event Generator 1 Select bit 1 position
.equ PORT_EVGEN1SEL_2_bm = (1<<6)        ; Event Generator 1 Select bit 2 mask
.equ PORT_EVGEN1SEL_2_bp = 6             ; Event Generator 1 Select bit 2 position

; Event Generator 0 Select
.equ PORT_EVGEN0SEL_PIN0_gc = (0x00<<0)  ; Pin 0 used as event generator
.equ PORT_EVGEN0SEL_PIN1_gc = (0x01<<0)  ; Pin 1 used as event generator
.equ PORT_EVGEN0SEL_PIN2_gc = (0x02<<0)  ; Pin 2 used as event generator
.equ PORT_EVGEN0SEL_PIN3_gc = (0x03<<0)  ; Pin 3 used as event generator
.equ PORT_EVGEN0SEL_PIN4_gc = (0x04<<0)  ; Pin 4 used as event generator
.equ PORT_EVGEN0SEL_PIN5_gc = (0x05<<0)  ; Pin 5 used as event generator
.equ PORT_EVGEN0SEL_PIN6_gc = (0x06<<0)  ; Pin 6 used as event generator
.equ PORT_EVGEN0SEL_PIN7_gc = (0x07<<0)  ; Pin 7 used as event generator

; Event Generator 1 Select
.equ PORT_EVGEN1SEL_PIN0_gc = (0x00<<4)  ; Pin 0 used as event generator
.equ PORT_EVGEN1SEL_PIN1_gc = (0x01<<4)  ; Pin 1 used as event generator
.equ PORT_EVGEN1SEL_PIN2_gc = (0x02<<4)  ; Pin 2 used as event generator
.equ PORT_EVGEN1SEL_PIN3_gc = (0x03<<4)  ; Pin 3 used as event generator
.equ PORT_EVGEN1SEL_PIN4_gc = (0x04<<4)  ; Pin 4 used as event generator
.equ PORT_EVGEN1SEL_PIN5_gc = (0x05<<4)  ; Pin 5 used as event generator
.equ PORT_EVGEN1SEL_PIN6_gc = (0x06<<4)  ; Pin 6 used as event generator
.equ PORT_EVGEN1SEL_PIN7_gc = (0x07<<4)  ; Pin 7 used as event generator

; Input Level Select
.equ PORT_INLVL_ST_gc = (0x00<<6)        ; Schmitt-Trigger input level
.equ PORT_INLVL_TTL_gc = (0x01<<6)       ; TTL Input level

; Input/Sense Configuration select
.equ PORT_ISC_INTDISABLE_gc = (0x00<<0)  ; Interrupt disabled but input buffer enabled
.equ PORT_ISC_BOTHEDGES_gc = (0x01<<0)   ; Sense Both Edges
.equ PORT_ISC_RISING_gc = (0x02<<0)      ; Sense Rising Edge
.equ PORT_ISC_FALLING_gc = (0x03<<0)     ; Sense Falling Edge
.equ PORT_ISC_INPUT_DISABLE_gc = (0x04<<0) ; Digital Input Buffer disabled
.equ PORT_ISC_LEVEL_gc = (0x05<<0)       ; Sense low Level


;*************************************************************************
;** PORTMUX - Port Multiplexer
;*************************************************************************

; PORTMUX_EVSYSROUTEA masks
.equ PORTMUX_EVOUTA_bm = 0x01            ; Event Output A bit mask
.equ PORTMUX_EVOUTA_bp = 0               ; Event Output A bit position
.equ PORTMUX_EVOUTD_bm = 0x08            ; Event Output D bit mask
.equ PORTMUX_EVOUTD_bp = 3               ; Event Output D bit position
.equ PORTMUX_EVOUTF_bm = 0x20            ; Event Output F bit mask
.equ PORTMUX_EVOUTF_bp = 5               ; Event Output F bit position

; PORTMUX_CCLROUTEA masks
.equ PORTMUX_LUT0_bm = 0x01              ; CCL Look-Up Table 0 Signals bit mask
.equ PORTMUX_LUT0_bp = 0                 ; CCL Look-Up Table 0 Signals bit position
.equ PORTMUX_LUT1_bm = 0x02              ; CCL Look-Up Table 1 Signals bit mask
.equ PORTMUX_LUT1_bp = 1                 ; CCL Look-Up Table 1 Signals bit position
.equ PORTMUX_LUT2_bm = 0x04              ; CCL Look-Up Table 2 Signals bit mask
.equ PORTMUX_LUT2_bp = 2                 ; CCL Look-Up Table 2 Signals bit position

; PORTMUX_USARTROUTEA masks
.equ PORTMUX_USART0_gm = 0x07            ; USART0 Signals group mask
.equ PORTMUX_USART0_gp = 0               ; USART0 Signals group position
.equ PORTMUX_USART0_0_bm = (1<<0)        ; USART0 Signals bit 0 mask
.equ PORTMUX_USART0_0_bp = 0             ; USART0 Signals bit 0 position
.equ PORTMUX_USART0_1_bm = (1<<1)        ; USART0 Signals bit 1 mask
.equ PORTMUX_USART0_1_bp = 1             ; USART0 Signals bit 1 position
.equ PORTMUX_USART0_2_bm = (1<<2)        ; USART0 Signals bit 2 mask
.equ PORTMUX_USART0_2_bp = 2             ; USART0 Signals bit 2 position
.equ PORTMUX_USART1_gm = 0x18            ; USART1 Signals group mask
.equ PORTMUX_USART1_gp = 3               ; USART1 Signals group position
.equ PORTMUX_USART1_0_bm = (1<<3)        ; USART1 Signals bit 0 mask
.equ PORTMUX_USART1_0_bp = 3             ; USART1 Signals bit 0 position
.equ PORTMUX_USART1_1_bm = (1<<4)        ; USART1 Signals bit 1 mask
.equ PORTMUX_USART1_1_bp = 4             ; USART1 Signals bit 1 position

; PORTMUX_SPIROUTEA masks
.equ PORTMUX_SPI0_gm = 0x07              ; SPI0 Signals group mask
.equ PORTMUX_SPI0_gp = 0                 ; SPI0 Signals group position
.equ PORTMUX_SPI0_0_bm = (1<<0)          ; SPI0 Signals bit 0 mask
.equ PORTMUX_SPI0_0_bp = 0               ; SPI0 Signals bit 0 position
.equ PORTMUX_SPI0_1_bm = (1<<1)          ; SPI0 Signals bit 1 mask
.equ PORTMUX_SPI0_1_bp = 1               ; SPI0 Signals bit 1 position
.equ PORTMUX_SPI0_2_bm = (1<<2)          ; SPI0 Signals bit 2 mask
.equ PORTMUX_SPI0_2_bp = 2               ; SPI0 Signals bit 2 position

; PORTMUX_TWIROUTEA masks
.equ PORTMUX_TWI0_gm = 0x03              ; TWI0 Signals group mask
.equ PORTMUX_TWI0_gp = 0                 ; TWI0 Signals group position
.equ PORTMUX_TWI0_0_bm = (1<<0)          ; TWI0 Signals bit 0 mask
.equ PORTMUX_TWI0_0_bp = 0               ; TWI0 Signals bit 0 position
.equ PORTMUX_TWI0_1_bm = (1<<1)          ; TWI0 Signals bit 1 mask
.equ PORTMUX_TWI0_1_bp = 1               ; TWI0 Signals bit 1 position

; PORTMUX_TCAROUTEA masks
.equ PORTMUX_TCA0_gm = 0x07              ; TCA0 Signals group mask
.equ PORTMUX_TCA0_gp = 0                 ; TCA0 Signals group position
.equ PORTMUX_TCA0_0_bm = (1<<0)          ; TCA0 Signals bit 0 mask
.equ PORTMUX_TCA0_0_bp = 0               ; TCA0 Signals bit 0 position
.equ PORTMUX_TCA0_1_bm = (1<<1)          ; TCA0 Signals bit 1 mask
.equ PORTMUX_TCA0_1_bp = 1               ; TCA0 Signals bit 1 position
.equ PORTMUX_TCA0_2_bm = (1<<2)          ; TCA0 Signals bit 2 mask
.equ PORTMUX_TCA0_2_bp = 2               ; TCA0 Signals bit 2 position

; PORTMUX_TCBROUTEA masks
.equ PORTMUX_TCB0_bm = 0x01              ; TCB0 Output bit mask
.equ PORTMUX_TCB0_bp = 0                 ; TCB0 Output bit position
.equ PORTMUX_TCB1_bm = 0x02              ; TCB1 Output bit mask
.equ PORTMUX_TCB1_bp = 1                 ; TCB1 Output bit position

; CCL Look-Up Table 0 Signals select
.equ PORTMUX_LUT0_DEFAULT_gc = (0x00<<0) ; In: PA0, PA1, PA2, Out: PA3
.equ PORTMUX_LUT0_ALT1_gc = (0x01<<0)    ; In: PA0, PA1, PA2, Out: PA6

; CCL Look-Up Table 1 Signals select
.equ PORTMUX_LUT1_DEFAULT_gc = (0x00<<1) ; In: -, -, -, Out: PC3

; CCL Look-Up Table 2 Signals select
.equ PORTMUX_LUT2_DEFAULT_gc = (0x00<<2) ; Not connected to any pins
.equ PORTMUX_LUT2_ALT1_gc = (0x01<<2)    ; In: -, -, -, Out: PD6

; Event Output A select
.equ PORTMUX_EVOUTA_DEFAULT_gc = (0x00<<0) ; EVOUTA: PA2
.equ PORTMUX_EVOUTA_ALT1_gc = (0x01<<0)  ; EVOUTA: PA7

; Event Output D select
.equ PORTMUX_EVOUTD_DEFAULT_gc = (0x00<<3) ; Not connected to any pins
.equ PORTMUX_EVOUTD_ALT1_gc = (0x01<<3)  ; EVOUTD: PD7

