pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR32DU20def.inc
; USART_EVCTRL masks
.equ USART_IREI_bm = 0x01                ; IrDA Event Input Enable bit mask
.equ USART_IREI_bp = 0                   ; IrDA Event Input Enable bit position

; USART_TXPLCTRL masks
.equ USART_TXPL_gm = 0xFF                ; Transmit pulse length group mask
.equ USART_TXPL_gp = 0                   ; Transmit pulse length group position
.equ USART_TXPL_0_bm = (1<<0)            ; Transmit pulse length bit 0 mask
.equ USART_TXPL_0_bp = 0                 ; Transmit pulse length bit 0 position
.equ USART_TXPL_1_bm = (1<<1)            ; Transmit pulse length bit 1 mask
.equ USART_TXPL_1_bp = 1                 ; Transmit pulse length bit 1 position
.equ USART_TXPL_2_bm = (1<<2)            ; Transmit pulse length bit 2 mask
.equ USART_TXPL_2_bp = 2                 ; Transmit pulse length bit 2 position
.equ USART_TXPL_3_bm = (1<<3)            ; Transmit pulse length bit 3 mask
.equ USART_TXPL_3_bp = 3                 ; Transmit pulse length bit 3 position
.equ USART_TXPL_4_bm = (1<<4)            ; Transmit pulse length bit 4 mask
.equ USART_TXPL_4_bp = 4                 ; Transmit pulse length bit 4 position
.equ USART_TXPL_5_bm = (1<<5)            ; Transmit pulse length bit 5 mask
.equ USART_TXPL_5_bp = 5                 ; Transmit pulse length bit 5 position
.equ USART_TXPL_6_bm = (1<<6)            ; Transmit pulse length bit 6 mask
.equ USART_TXPL_6_bp = 6                 ; Transmit pulse length bit 6 position
.equ USART_TXPL_7_bm = (1<<7)            ; Transmit pulse length bit 7 mask
.equ USART_TXPL_7_bp = 7                 ; Transmit pulse length bit 7 position

; USART_RXPLCTRL masks
.equ USART_RXPL_gm = 0x7F                ; Receiver Pulse Lenght group mask
.equ USART_RXPL_gp = 0                   ; Receiver Pulse Lenght group position
.equ USART_RXPL_0_bm = (1<<0)            ; Receiver Pulse Lenght bit 0 mask
.equ USART_RXPL_0_bp = 0                 ; Receiver Pulse Lenght bit 0 position
.equ USART_RXPL_1_bm = (1<<1)            ; Receiver Pulse Lenght bit 1 mask
.equ USART_RXPL_1_bp = 1                 ; Receiver Pulse Lenght bit 1 position
.equ USART_RXPL_2_bm = (1<<2)            ; Receiver Pulse Lenght bit 2 mask
.equ USART_RXPL_2_bp = 2                 ; Receiver Pulse Lenght bit 2 position
.equ USART_RXPL_3_bm = (1<<3)            ; Receiver Pulse Lenght bit 3 mask
.equ USART_RXPL_3_bp = 3                 ; Receiver Pulse Lenght bit 3 position
.equ USART_RXPL_4_bm = (1<<4)            ; Receiver Pulse Lenght bit 4 mask
.equ USART_RXPL_4_bp = 4                 ; Receiver Pulse Lenght bit 4 position
.equ USART_RXPL_5_bm = (1<<5)            ; Receiver Pulse Lenght bit 5 mask
.equ USART_RXPL_5_bp = 5                 ; Receiver Pulse Lenght bit 5 position
.equ USART_RXPL_6_bm = (1<<6)            ; Receiver Pulse Lenght bit 6 mask
.equ USART_RXPL_6_bp = 6                 ; Receiver Pulse Lenght bit 6 position

; RS485 Mode internal transmitter select
.equ USART_RS485_DISABLE_gc = (0x00<<0)  ; RS485 Mode disabled
.equ USART_RS485_ENABLE_gc = (0x01<<0)   ; RS485 Mode enabled

; Receiver Mode select
.equ USART_RXMODE_NORMAL_gc = (0x00<<1)  ; Normal mode
.equ USART_RXMODE_CLK2X_gc = (0x01<<1)   ; CLK2x mode
.equ USART_RXMODE_GENAUTO_gc = (0x02<<1) ; Generic autobaud mode
.equ USART_RXMODE_LINAUTO_gc = (0x03<<1) ; LIN constrained autobaud mode

; Communication Mode select
.equ USART_CMODE_ASYNCHRONOUS_gc = (0x00<<6) ; Asynchronous Mode
.equ USART_CMODE_SYNCHRONOUS_gc = (0x01<<6) ; Synchronous Mode
.equ USART_CMODE_IRCOM_gc = (0x02<<6)    ; Infrared Communication
.equ USART_CMODE_MSPI_gc = (0x03<<6)     ; SPI Host Mode

; Character Size select
.equ USART_NORMAL_CHSIZE_5BIT_gc = (0x00<<0) ; Character size: 5 bit
.equ USART_NORMAL_CHSIZE_6BIT_gc = (0x01<<0) ; Character size: 6 bit
.equ USART_NORMAL_CHSIZE_7BIT_gc = (0x02<<0) ; Character size: 7 bit
.equ USART_NORMAL_CHSIZE_8BIT_gc = (0x03<<0) ; Character size: 8 bit
.equ USART_NORMAL_CHSIZE_9BITL_gc = (0x06<<0) ; Character size: 9 bit read low byte first
.equ USART_NORMAL_CHSIZE_9BITH_gc = (0x07<<0) ; Character size: 9 bit read high byte first

; Parity Mode select
.equ USART_NORMAL_PMODE_DISABLED_gc = (0x00<<4) ; No Parity
.equ USART_NORMAL_PMODE_EVEN_gc = (0x02<<4) ; Even Parity
.equ USART_NORMAL_PMODE_ODD_gc = (0x03<<4) ; Odd Parity

; Stop Bit Mode select
.equ USART_NORMAL_SBMODE_1BIT_gc = (0x00<<3) ; 1 stop bit
.equ USART_NORMAL_SBMODE_2BIT_gc = (0x01<<3) ; 2 stop bits

; Auto Baud Window select
.equ USART_ABW_WDW0_gc = (0x00<<6)       ; 18% tolerance
.equ USART_ABW_WDW1_gc = (0x01<<6)       ; 15% tolerance
.equ USART_ABW_WDW2_gc = (0x02<<6)       ; 21% tolerance
.equ USART_ABW_WDW3_gc = (0x03<<6)       ; 25% tolerance


;*************************************************************************
;** USB - USB Device Controller
;*************************************************************************

; USB_EP_STATUS masks
.equ USB_EP_TOGGLE_bm = 0x01             ; Data Toggle bit mask
.equ USB_EP_TOGGLE_bp = 0                ; Data Toggle bit position
.equ USB_EP_BUSNAK_bm = 0x02             ; Data Buffer NAK bit mask
.equ USB_EP_BUSNAK_bp = 1                ; Data Buffer NAK bit position
.equ USB_EP_STALLED_bm = 0x08            ; EP Stalled bit mask
.equ USB_EP_STALLED_bp = 3               ; EP Stalled bit position
.equ USB_EP_EPSETUP_bm = 0x10            ; EP Setup Complete bit mask
.equ USB_EP_EPSETUP_bp = 4               ; EP Setup Complete bit position
.equ USB_EP_TRNCOMPL_bm = 0x20           ; Transaction Complete bit mask
.equ USB_EP_TRNCOMPL_bp = 5              ; Transaction Complete bit position
.equ USB_EP_UNFOVF_bm = 0x40             ; Underflow/Overflow EP bit mask
.equ USB_EP_UNFOVF_bp = 6                ; Underflow/Overflow EP bit position
.equ USB_EP_CRC_bm = 0x80                ; CRC Error bit mask
.equ USB_EP_CRC_bp = 7                   ; CRC Error bit position

; USB_EP_CTRL masks
.equ USB_EP_BUFSIZE_DEFAULT_gm = 0x03    ; Data Size default group mask
.equ USB_EP_BUFSIZE_DEFAULT_gp = 0       ; Data Size default group position
.equ USB_EP_BUFSIZE_DEFAULT_0_bm = (1<<0) ; Data Size default bit 0 mask
.equ USB_EP_BUFSIZE_DEFAULT_0_bp = 0     ; Data Size default bit 0 position
.equ USB_EP_BUFSIZE_DEFAULT_1_bm = (1<<1) ; Data Size default bit 1 mask
.equ USB_EP_BUFSIZE_DEFAULT_1_bp = 1     ; Data Size default bit 1 position
.equ USB_EP_DOSTALL_bm = 0x04            ; Endpoint will respond with STALL bit mask
.equ USB_EP_DOSTALL_bp = 2               ; Endpoint will respond with STALL bit position
.equ USB_EP_BUFSIZE_ISO_gm = 0x07        ; Data Size isochronous group mask
.equ USB_EP_BUFSIZE_ISO_gp = 0           ; Data Size isochronous group position
.equ USB_EP_BUFSIZE_ISO_0_bm = (1<<0)    ; Data Size isochronous bit 0 mask
.equ USB_EP_BUFSIZE_ISO_0_bp = 0         ; Data Size isochronous bit 0 position
.equ USB_EP_BUFSIZE_ISO_1_bm = (1<<1)    ; Data Size isochronous bit 1 mask
.equ USB_EP_BUFSIZE_ISO_1_bp = 1         ; Data Size isochronous bit 1 position
.equ USB_EP_BUFSIZE_ISO_2_bm = (1<<2)    ; Data Size isochronous bit 2 mask
.equ USB_EP_BUFSIZE_ISO_2_bp = 2         ; Data Size isochronous bit 2 position
.equ USB_EP_TCDSBL_bm = 0x08             ; TRNCOMPL Interrupt Disable bit mask
.equ USB_EP_TCDSBL_bp = 3                ; TRNCOMPL Interrupt Disable bit position
.equ USB_EP_AZLP_bm = 0x10               ; Automatic zero length packet bit mask
.equ USB_EP_AZLP_bp = 4                  ; Automatic zero length packet bit position
.equ USB_EP_MULTIPKT_bm = 0x20           ; Multipacket transfer enable bit mask
.equ USB_EP_MULTIPKT_bp = 5              ; Multipacket transfer enable bit position
.equ USB_EP_TYPE_gm = 0xC0               ; Endpoint type group mask
.equ USB_EP_TYPE_gp = 6                  ; Endpoint type group position
.equ USB_EP_TYPE_0_bm = (1<<6)           ; Endpoint type bit 0 mask
.equ USB_EP_TYPE_0_bp = 6                ; Endpoint type bit 0 position
.equ USB_EP_TYPE_1_bm = (1<<7)           ; Endpoint type bit 1 mask
.equ USB_EP_TYPE_1_bp = 7                ; Endpoint type bit 1 position

; USB_EP_CNT masks
.equ USB_EP_CNT_gm = 0xFFFF              ; Endpoint Byte Count group mask
.equ USB_EP_CNT_gp = 0                   ; Endpoint Byte Count group position
.equ USB_EP_CNT_0_bm = (1<<0)            ; Endpoint Byte Count bit 0 mask
.equ USB_EP_CNT_0_bp = 0                 ; Endpoint Byte Count bit 0 position
.equ USB_EP_CNT_1_bm = (1<<1)            ; Endpoint Byte Count bit 1 mask
.equ USB_EP_CNT_1_bp = 1                 ; Endpoint Byte Count bit 1 position
.equ USB_EP_CNT_2_bm = (1<<2)            ; Endpoint Byte Count bit 2 mask
.equ USB_EP_CNT_2_bp = 2                 ; Endpoint Byte Count bit 2 position
.equ USB_EP_CNT_3_bm = (1<<3)            ; Endpoint Byte Count bit 3 mask
.equ USB_EP_CNT_3_bp = 3                 ; Endpoint Byte Count bit 3 position
.equ USB_EP_CNT_4_bm = (1<<4)            ; Endpoint Byte Count bit 4 mask
.equ USB_EP_CNT_4_bp = 4                 ; Endpoint Byte Count bit 4 position
.equ USB_EP_CNT_5_bm = (1<<5)            ; Endpoint Byte Count bit 5 mask
.equ USB_EP_CNT_5_bp = 5                 ; Endpoint Byte Count bit 5 position
.equ USB_EP_CNT_6_bm = (1<<6)            ; Endpoint Byte Count bit 6 mask
.equ USB_EP_CNT_6_bp = 6                 ; Endpoint Byte Count bit 6 position
.equ USB_EP_CNT_7_bm = (1<<7)            ; Endpoint Byte Count bit 7 mask
.equ USB_EP_CNT_7_bp = 7                 ; Endpoint Byte Count bit 7 position
.equ USB_EP_CNT_8_bm = (1<<8)            ; Endpoint Byte Count bit 8 mask
.equ USB_EP_CNT_8_bp = 8                 ; Endpoint Byte Count bit 8 position
.equ USB_EP_CNT_9_bm = (1<<9)            ; Endpoint Byte Count bit 9 mask
.equ USB_EP_CNT_9_bp = 9                 ; Endpoint Byte Count bit 9 position
.equ USB_EP_CNT_10_bm = (1<<10)          ; Endpoint Byte Count bit 10 mask
.equ USB_EP_CNT_10_bp = 10               ; Endpoint Byte Count bit 10 position
.equ USB_EP_CNT_11_bm = (1<<11)          ; Endpoint Byte Count bit 11 mask
.equ USB_EP_CNT_11_bp = 11               ; Endpoint Byte Count bit 11 position
.equ USB_EP_CNT_12_bm = (1<<12)          ; Endpoint Byte Count bit 12 mask
.equ USB_EP_CNT_12_bp = 12               ; Endpoint Byte Count bit 12 position
.equ USB_EP_CNT_13_bm = (1<<13)          ; Endpoint Byte Count bit 13 mask
.equ USB_EP_CNT_13_bp = 13               ; Endpoint Byte Count bit 13 position
.equ USB_EP_CNT_14_bm = (1<<14)          ; Endpoint Byte Count bit 14 mask
.equ USB_EP_CNT_14_bp = 14               ; Endpoint Byte Count bit 14 position
.equ USB_EP_CNT_15_bm = (1<<15)          ; Endpoint Byte Count bit 15 mask
.equ USB_EP_CNT_15_bp = 15               ; Endpoint Byte Count bit 15 position

; USB_EP_DATAPTR masks
.equ USB_EP_DATAPTR_gm = 0xFFFF          ; Endpoint data pointer group mask
.equ USB_EP_DATAPTR_gp = 0               ; Endpoint data pointer group position
.equ USB_EP_DATAPTR_0_bm = (1<<0)        ; Endpoint data pointer bit 0 mask
.equ USB_EP_DATAPTR_0_bp = 0             ; Endpoint data pointer bit 0 position
.equ USB_EP_DATAPTR_1_bm = (1<<1)        ; Endpoint data pointer bit 1 mask
.equ USB_EP_DATAPTR_1_bp = 1             ; Endpoint data pointer bit 1 position
.equ USB_EP_DATAPTR_2_bm = (1<<2)        ; Endpoint data pointer bit 2 mask
.equ USB_EP_DATAPTR_2_bp = 2             ; Endpoint data pointer bit 2 position
.equ USB_EP_DATAPTR_3_bm = (1<<3)        ; Endpoint data pointer bit 3 mask
.equ USB_EP_DATAPTR_3_bp = 3             ; Endpoint data pointer bit 3 position
.equ USB_EP_DATAPTR_4_bm = (1<<4)        ; Endpoint data pointer bit 4 mask
.equ USB_EP_DATAPTR_4_bp = 4             ; Endpoint data pointer bit 4 position
.equ USB_EP_DATAPTR_5_bm = (1<<5)        ; Endpoint data pointer bit 5 mask
.equ USB_EP_DATAPTR_5_bp = 5             ; Endpoint data pointer bit 5 position
.equ USB_EP_DATAPTR_6_bm = (1<<6)        ; Endpoint data pointer bit 6 mask
.equ USB_EP_DATAPTR_6_bp = 6             ; Endpoint data pointer bit 6 position
.equ USB_EP_DATAPTR_7_bm = (1<<7)        ; Endpoint data pointer bit 7 mask
.equ USB_EP_DATAPTR_7_bp = 7             ; Endpoint data pointer bit 7 position
.equ USB_EP_DATAPTR_8_bm = (1<<8)        ; Endpoint data pointer bit 8 mask
.equ USB_EP_DATAPTR_8_bp = 8             ; Endpoint data pointer bit 8 position
.equ USB_EP_DATAPTR_9_bm = (1<<9)        ; Endpoint data pointer bit 9 mask
.equ USB_EP_DATAPTR_9_bp = 9             ; Endpoint data pointer bit 9 position
.equ USB_EP_DATAPTR_10_bm = (1<<10)      ; Endpoint data pointer bit 10 mask
.equ USB_EP_DATAPTR_10_bp = 10           ; Endpoint data pointer bit 10 position
.equ USB_EP_DATAPTR_11_bm = (1<<11)      ; Endpoint data pointer bit 11 mask
.equ USB_EP_DATAPTR_11_bp = 11           ; Endpoint data pointer bit 11 position
.equ USB_EP_DATAPTR_12_bm = (1<<12)      ; Endpoint data pointer bit 12 mask
.equ USB_EP_DATAPTR_12_bp = 12           ; Endpoint data pointer bit 12 position
.equ USB_EP_DATAPTR_13_bm = (1<<13)      ; Endpoint data pointer bit 13 mask
.equ USB_EP_DATAPTR_13_bp = 13           ; Endpoint data pointer bit 13 position
.equ USB_EP_DATAPTR_14_bm = (1<<14)      ; Endpoint data pointer bit 14 mask
.equ USB_EP_DATAPTR_14_bp = 14           ; Endpoint data pointer bit 14 position
.equ USB_EP_DATAPTR_15_bm = (1<<15)      ; Endpoint data pointer bit 15 mask
.equ USB_EP_DATAPTR_15_bp = 15           ; Endpoint data pointer bit 15 position

; USB_EP_MCNT masks
.equ USB_EP_MCNT_gm = 0xFFFF             ; Multi-packet byte count group mask
.equ USB_EP_MCNT_gp = 0                  ; Multi-packet byte count group position
.equ USB_EP_MCNT_0_bm = (1<<0)           ; Multi-packet byte count bit 0 mask
.equ USB_EP_MCNT_0_bp = 0                ; Multi-packet byte count bit 0 position
.equ USB_EP_MCNT_1_bm = (1<<1)           ; Multi-packet byte count bit 1 mask
.equ USB_EP_MCNT_1_bp = 1                ; Multi-packet byte count bit 1 position
.equ USB_EP_MCNT_2_bm = (1<<2)           ; Multi-packet byte count bit 2 mask
.equ USB_EP_MCNT_2_bp = 2                ; Multi-packet byte count bit 2 position
.equ USB_EP_MCNT_3_bm = (1<<3)           ; Multi-packet byte count bit 3 mask
.equ USB_EP_MCNT_3_bp = 3                ; Multi-packet byte count bit 3 position
.equ USB_EP_MCNT_4_bm = (1<<4)           ; Multi-packet byte count bit 4 mask
.equ USB_EP_MCNT_4_bp = 4                ; Multi-packet byte count bit 4 position
.equ USB_EP_MCNT_5_bm = (1<<5)           ; Multi-packet byte count bit 5 mask
.equ USB_EP_MCNT_5_bp = 5                ; Multi-packet byte count bit 5 position
.equ USB_EP_MCNT_6_bm = (1<<6)           ; Multi-packet byte count bit 6 mask
.equ USB_EP_MCNT_6_bp = 6                ; Multi-packet byte count bit 6 position
.equ USB_EP_MCNT_7_bm = (1<<7)           ; Multi-packet byte count bit 7 mask
.equ USB_EP_MCNT_7_bp = 7                ; Multi-packet byte count bit 7 position
.equ USB_EP_MCNT_8_bm = (1<<8)           ; Multi-packet byte count bit 8 mask
.equ USB_EP_MCNT_8_bp = 8                ; Multi-packet byte count bit 8 position
.equ USB_EP_MCNT_9_bm = (1<<9)           ; Multi-packet byte count bit 9 mask
.equ USB_EP_MCNT_9_bp = 9                ; Multi-packet byte count bit 9 position
.equ USB_EP_MCNT_10_bm = (1<<10)         ; Multi-packet byte count bit 10 mask
.equ USB_EP_MCNT_10_bp = 10              ; Multi-packet byte count bit 10 position
.equ USB_EP_MCNT_11_bm = (1<<11)         ; Multi-packet byte count bit 11 mask
.equ USB_EP_MCNT_11_bp = 11              ; Multi-packet byte count bit 11 position
.equ USB_EP_MCNT_12_bm = (1<<12)         ; Multi-packet byte count bit 12 mask
.equ USB_EP_MCNT_12_bp = 12              ; Multi-packet byte count bit 12 position
.equ USB_EP_MCNT_13_bm = (1<<13)         ; Multi-packet byte count bit 13 mask
.equ USB_EP_MCNT_13_bp = 13              ; Multi-packet byte count bit 13 position
.equ USB_EP_MCNT_14_bm = (1<<14)         ; Multi-packet byte count bit 14 mask
.equ USB_EP_MCNT_14_bp = 14              ; Multi-packet byte count bit 14 position
.equ USB_EP_MCNT_15_bm = (1<<15)         ; Multi-packet byte count bit 15 mask
.equ USB_EP_MCNT_15_bp = 15              ; Multi-packet byte count bit 15 position

