pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR32DU20def.inc
; USB_ADDR masks
.equ USB_ADDR_gm = 0x7F                  ; Device Address group mask
.equ USB_ADDR_gp = 0                     ; Device Address group position
.equ USB_ADDR_0_bm = (1<<0)              ; Device Address bit 0 mask
.equ USB_ADDR_0_bp = 0                   ; Device Address bit 0 position
.equ USB_ADDR_1_bm = (1<<1)              ; Device Address bit 1 mask
.equ USB_ADDR_1_bp = 1                   ; Device Address bit 1 position
.equ USB_ADDR_2_bm = (1<<2)              ; Device Address bit 2 mask
.equ USB_ADDR_2_bp = 2                   ; Device Address bit 2 position
.equ USB_ADDR_3_bm = (1<<3)              ; Device Address bit 3 mask
.equ USB_ADDR_3_bp = 3                   ; Device Address bit 3 position
.equ USB_ADDR_4_bm = (1<<4)              ; Device Address bit 4 mask
.equ USB_ADDR_4_bp = 4                   ; Device Address bit 4 position
.equ USB_ADDR_5_bm = (1<<5)              ; Device Address bit 5 mask
.equ USB_ADDR_5_bp = 5                   ; Device Address bit 5 position
.equ USB_ADDR_6_bm = (1<<6)              ; Device Address bit 6 mask
.equ USB_ADDR_6_bp = 6                   ; Device Address bit 6 position

; USB_FIFOWP masks
.equ USB_FIFOWP_gm = 0x1F                ; FIFO Write Pointer group mask
.equ USB_FIFOWP_gp = 0                   ; FIFO Write Pointer group position
.equ USB_FIFOWP_0_bm = (1<<0)            ; FIFO Write Pointer bit 0 mask
.equ USB_FIFOWP_0_bp = 0                 ; FIFO Write Pointer bit 0 position
.equ USB_FIFOWP_1_bm = (1<<1)            ; FIFO Write Pointer bit 1 mask
.equ USB_FIFOWP_1_bp = 1                 ; FIFO Write Pointer bit 1 position
.equ USB_FIFOWP_2_bm = (1<<2)            ; FIFO Write Pointer bit 2 mask
.equ USB_FIFOWP_2_bp = 2                 ; FIFO Write Pointer bit 2 position
.equ USB_FIFOWP_3_bm = (1<<3)            ; FIFO Write Pointer bit 3 mask
.equ USB_FIFOWP_3_bp = 3                 ; FIFO Write Pointer bit 3 position
.equ USB_FIFOWP_4_bm = (1<<4)            ; FIFO Write Pointer bit 4 mask
.equ USB_FIFOWP_4_bp = 4                 ; FIFO Write Pointer bit 4 position

; USB_FIFORP masks
.equ USB_FIFORP_gm = 0x1F                ; FIFO Read Pointer group mask
.equ USB_FIFORP_gp = 0                   ; FIFO Read Pointer group position
.equ USB_FIFORP_0_bm = (1<<0)            ; FIFO Read Pointer bit 0 mask
.equ USB_FIFORP_0_bp = 0                 ; FIFO Read Pointer bit 0 position
.equ USB_FIFORP_1_bm = (1<<1)            ; FIFO Read Pointer bit 1 mask
.equ USB_FIFORP_1_bp = 1                 ; FIFO Read Pointer bit 1 position
.equ USB_FIFORP_2_bm = (1<<2)            ; FIFO Read Pointer bit 2 mask
.equ USB_FIFORP_2_bp = 2                 ; FIFO Read Pointer bit 2 position
.equ USB_FIFORP_3_bm = (1<<3)            ; FIFO Read Pointer bit 3 mask
.equ USB_FIFORP_3_bp = 3                 ; FIFO Read Pointer bit 3 position
.equ USB_FIFORP_4_bm = (1<<4)            ; FIFO Read Pointer bit 4 mask
.equ USB_FIFORP_4_bp = 4                 ; FIFO Read Pointer bit 4 position

; USB_EPPTR masks
.equ USB_EPPTR_gm = 0xFFFF               ; Endpoint Configuration Table Pointer group mask
.equ USB_EPPTR_gp = 0                    ; Endpoint Configuration Table Pointer group position
.equ USB_EPPTR_0_bm = (1<<0)             ; Endpoint Configuration Table Pointer bit 0 mask
.equ USB_EPPTR_0_bp = 0                  ; Endpoint Configuration Table Pointer bit 0 position
.equ USB_EPPTR_1_bm = (1<<1)             ; Endpoint Configuration Table Pointer bit 1 mask
.equ USB_EPPTR_1_bp = 1                  ; Endpoint Configuration Table Pointer bit 1 position
.equ USB_EPPTR_2_bm = (1<<2)             ; Endpoint Configuration Table Pointer bit 2 mask
.equ USB_EPPTR_2_bp = 2                  ; Endpoint Configuration Table Pointer bit 2 position
.equ USB_EPPTR_3_bm = (1<<3)             ; Endpoint Configuration Table Pointer bit 3 mask
.equ USB_EPPTR_3_bp = 3                  ; Endpoint Configuration Table Pointer bit 3 position
.equ USB_EPPTR_4_bm = (1<<4)             ; Endpoint Configuration Table Pointer bit 4 mask
.equ USB_EPPTR_4_bp = 4                  ; Endpoint Configuration Table Pointer bit 4 position
.equ USB_EPPTR_5_bm = (1<<5)             ; Endpoint Configuration Table Pointer bit 5 mask
.equ USB_EPPTR_5_bp = 5                  ; Endpoint Configuration Table Pointer bit 5 position
.equ USB_EPPTR_6_bm = (1<<6)             ; Endpoint Configuration Table Pointer bit 6 mask
.equ USB_EPPTR_6_bp = 6                  ; Endpoint Configuration Table Pointer bit 6 position
.equ USB_EPPTR_7_bm = (1<<7)             ; Endpoint Configuration Table Pointer bit 7 mask
.equ USB_EPPTR_7_bp = 7                  ; Endpoint Configuration Table Pointer bit 7 position
.equ USB_EPPTR_8_bm = (1<<8)             ; Endpoint Configuration Table Pointer bit 8 mask
.equ USB_EPPTR_8_bp = 8                  ; Endpoint Configuration Table Pointer bit 8 position
.equ USB_EPPTR_9_bm = (1<<9)             ; Endpoint Configuration Table Pointer bit 9 mask
.equ USB_EPPTR_9_bp = 9                  ; Endpoint Configuration Table Pointer bit 9 position
.equ USB_EPPTR_10_bm = (1<<10)           ; Endpoint Configuration Table Pointer bit 10 mask
.equ USB_EPPTR_10_bp = 10                ; Endpoint Configuration Table Pointer bit 10 position
.equ USB_EPPTR_11_bm = (1<<11)           ; Endpoint Configuration Table Pointer bit 11 mask
.equ USB_EPPTR_11_bp = 11                ; Endpoint Configuration Table Pointer bit 11 position
.equ USB_EPPTR_12_bm = (1<<12)           ; Endpoint Configuration Table Pointer bit 12 mask
.equ USB_EPPTR_12_bp = 12                ; Endpoint Configuration Table Pointer bit 12 position
.equ USB_EPPTR_13_bm = (1<<13)           ; Endpoint Configuration Table Pointer bit 13 mask
.equ USB_EPPTR_13_bp = 13                ; Endpoint Configuration Table Pointer bit 13 position
.equ USB_EPPTR_14_bm = (1<<14)           ; Endpoint Configuration Table Pointer bit 14 mask
.equ USB_EPPTR_14_bp = 14                ; Endpoint Configuration Table Pointer bit 14 position
.equ USB_EPPTR_15_bm = (1<<15)           ; Endpoint Configuration Table Pointer bit 15 mask
.equ USB_EPPTR_15_bp = 15                ; Endpoint Configuration Table Pointer bit 15 position

; USB_INTCTRLA masks
.equ USB_OVF_bm = 0x02                   ; Overflow Interrupt Enable bit mask
.equ USB_OVF_bp = 1                      ; Overflow Interrupt Enable bit position
.equ USB_UNF_bm = 0x04                   ; Underflow Interrupt Enable bit mask
.equ USB_UNF_bp = 2                      ; Underflow Interrupt Enable bit position
.equ USB_STALLED_bm = 0x08               ; STALL Interrupt Enable bit mask
.equ USB_STALLED_bp = 3                  ; STALL Interrupt Enable bit position
.equ USB_RESET_bm = 0x10                 ; Reset Interrupt Enable bit mask
.equ USB_RESET_bp = 4                    ; Reset Interrupt Enable bit position
.equ USB_RESUME_bm = 0x20                ; Resume Interrupt Enable bit mask
.equ USB_RESUME_bp = 5                   ; Resume Interrupt Enable bit position
.equ USB_SUSPEND_bm = 0x40               ; Suspend Interrupt Enable bit mask
.equ USB_SUSPEND_bp = 6                  ; Suspend Interrupt Enable bit position
.equ USB_SOF_bm = 0x80                   ; Start Of Frame Interrupt Enable bit mask
.equ USB_SOF_bp = 7                      ; Start Of Frame Interrupt Enable bit position

; USB_INTCTRLB masks
.equ USB_SETUP_bm = 0x01                 ; SETUP Transaction Complete Interrupt Enable bit mask
.equ USB_SETUP_bp = 0                    ; SETUP Transaction Complete Interrupt Enable bit position
.equ USB_GNDONE_bm = 0x02                ; GNAK Operation Done Interrupt Enable bit mask
.equ USB_GNDONE_bp = 1                   ; GNAK Operation Done Interrupt Enable bit position
.equ USB_TRNCOMPL_bm = 0x20              ; Transaction Complete Interrupt Enable bit mask
.equ USB_TRNCOMPL_bp = 5                 ; Transaction Complete Interrupt Enable bit position

; USB_INTFLAGSA masks
; Masks for USB_OVF already defined
; Masks for USB_UNF already defined
; Masks for USB_STALLED already defined
; Masks for USB_RESET already defined
; Masks for USB_RESUME already defined
; Masks for USB_SUSPEND already defined
; Masks for USB_SOF already defined

